In [1]:
# https://dplyr.tidyverse.org/reference/across.html
import numpy

from plyrda.data import iris
from plyrda.all import *

In [2]:
iris >> group_by(f.Species) >> summarise(across(starts_with("Sepal"), mean))

      Species  Sepal.Length  Sepal.Width
0      setosa         5.006        3.428
1  versicolor         5.936        2.770
2   virginica         6.588        2.974

In [3]:
iris = iris >> mutate(Species=as_categorical(f.Species))
iris.dtypes

Sepal.Length     float64
Sepal.Width      float64
Petal.Length     float64
Petal.Width      float64
Species         category
dtype: object

In [4]:
iris = iris >> mutate(across(where(is_categorical), as_character))
iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [5]:
iris >> group_by(f.Species) >> summarise(
    across(starts_with("Sepal"), mean, na_rm=True)
)

      Species  Sepal.Length  Sepal.Width
0      setosa         5.006        3.428
1  versicolor         5.936        2.770
2   virginica         6.588        2.974

In [6]:
iris >> group_by(f.Species) >> summarise(
    across(starts_with("Sepal"), dict(mean=mean, sd=sd))
)

,Species,Sepal.Length_mean,Sepal.Length_sd,Sepal.Width_mean,Sepal.Width_sd
0,setosa,5.006,0.352490,3.428,0.379064
1,versicolor,5.936,0.516171,2.770,0.313798
2,virginica,6.588,0.635880,2.974,0.322497

In [7]:
iris >> group_by(f.Species) >> summarise(
    across(starts_with("Sepal"), mean, _names = "mean_{_col}")
)

      Species  mean_Sepal.Length  mean_Sepal.Width
0      setosa              5.006             3.428
1  versicolor              5.936             2.770
2   virginica              6.588             2.974

In [8]:
iris >> group_by(f.Species) >> summarise(
    across(starts_with("Sepal"), dict(mean=mean, sd=sd), _names = "{_col}.{_fn}")
)

,Species,Sepal.Length.mean,Sepal.Length.sd,Sepal.Width.mean,Sepal.Width.sd
0,setosa,5.006,0.352490,3.428,0.379064
1,versicolor,5.936,0.516171,2.770,0.313798
2,virginica,6.588,0.635880,2.974,0.322497

In [9]:
iris >> group_by(f.Species) >> summarise(
    across(starts_with("Sepal"), [mean, sd], _names = "{_col}.fn{_fn}")
)

,Species,Sepal.Length.fn1,Sepal.Length.fn2,Sepal.Width.fn1,Sepal.Width.fn2
0,setosa,5.006,0.352490,3.428,0.379064
1,versicolor,5.936,0.516171,2.770,0.313798
2,virginica,6.588,0.635880,2.974,0.322497

In [10]:
runif = numpy.random.default_rng(8525).random
df = DataFrame(dict(
    id=[1, 2, 3, 4], 
    w=runif(4), 
    x=runif(4), 
    y=runif(4), 
    z=runif(4)
))
df >> rowwise() >> mutate(
    sum = c_across(f.w // f.z, sum), # function has to be called inside c_across
    sd = c_across(f.w // f.z, sd)
)

   id         w         x         y         z       sum        sd
0   1  0.038454  0.397815  0.046899  0.317985  0.801153  0.184922
1   2  0.091360  0.692043  0.707625  0.155806  1.646833  0.333798
2   3  0.642619  0.098516  0.904329  0.335591  1.981055  0.352114
3   4  0.902924  0.370697  0.840548  0.961739  3.075908  0.270091